<template>
  <div class="bodyApp">
  	<div class="grid-item" :class="{inview: checkView(0)}">
  		<uslugi></uslugi>
  	</div>
		<div class="grid-item" :class="{inview: checkView(1)}">
			<advantage></advantage>
	  </div>
	 
	  <div class="grid-item" :class="{inview: checkView(2)}"> Я увижу поверхность Марса, так или иначе. Уверен, это будет незабываемо. Мне кажется, наблюдение в телескоп за небесными телами должно быть такой же частью хорошего образования, как путешествия по миру.  <h2>Министерством ГО и ЧС РФ за №66-Б/00124 от 23 июня 2009за словесными горами в стране,</h2>
	  <h3>гласных и согласныхМинистерством ГО и ЧС РФ за №66-Б/00124 от 23 июня 2009Министерством ГО и ЧС РФ за №66-Б/00124 от 23 июня 2009</h3>
	  <h4>живут рыбные тексты. признанный эксперт в области проектирования, разработки, внедрения, обслуживания и ремонта оборудования систем безопастности. Деятельность предприятия по монтажу, техническому обслуживанию, и ремонту средств обеспечения пожарной </h4>
	  </div>
	  <div class="grid-item" :class="{inview: checkView(3)}"> Я увижу поверхность Марса, так или иначе. Уверен, это будет незабываемо. Мне кажется, наблюдение в телескоп за небесными телами должно быть такой же частью хорошего образования, как путешествия по миру.  <h2>Министерством ГО и ЧС РФ за №66-Б/00124 от 23 июня 2009за словесными горами в стране,</h2> Я увижу поверхность Марса, так или иначе. Уверен, это будет незабываемо. Мне кажется, наблюдение в телескоп за небесными телами должно быть такой же частью хорошего образования, как путешествия по миру.  <h2>Министерством ГО и ЧС РФ за №66-Б/00124 от 23 июня 2009за словесными горами в стране,</h2> Я увижу поверхность Марса, так или иначе. Уверен, это будет незабываемо. Мне кажется, наблюдение в телескоп за небесными телами должно быть такой же частью хорошего образования, как путешествия по миру.  <h2>Министерством ГО и ЧС РФ за №66-Б/00124 от 23 июня 2009за словесными горами в стране,</h2> Я увижу поверхность Марса, так или иначе. Уверен, это будет незабываемо. Мне кажется, наблюдение в телескоп за небесными телами должно быть такой же частью хорошего образования, как путешествия по миру.  <h2>Министерством ГО и ЧС РФ за №66-Б/00124 от 23 июня 2009за словесными горами в стране,</h2> Я увижу поверхность Марса, так или иначе. Уверен, это будет незабываемо. Мне кажется, наблюдение в телескоп за небесными телами должно быть такой же частью хорошего образования, как путешествия по миру.  <h2>Министерством ГО и ЧС РФ за №66-Б/00124 от 23 июня 2009за словесными горами в стране,</h2>
	  <h3>гласных и согласныхМинистерством ГО и ЧС РФ за №66-Б/00124 от 23 июня 2009Министерством ГО и ЧС РФ за №66-Б/00124 от 23 июня 2009</h3>
	  <h4>живут рыбные тексты. признанный эксперт в области проектирования, разработки, внедрения, обслуживания и ремонта оборудования систем безопастности. Деятельность предприятия по монтажу, техническому обслуживанию, и ремонту средств обеспечения пожарной </h4>
	  </div> 
	  <div class="grid-item" :class="{inview: checkView(4)}"> BodyApp Я увижу поверхность Марса, так или иначе. Уверен, это будет незабываемо. Мне кажется, наблюдение в телескоп за небесными телами должно быть такой же частью хорошего образования, как путешествия по миру.  <h2>Министерством ГО и ЧС РФ за №66-Б/00124 от 23 июня 2009за словесными горами в стране,</h2> Я увижу поверхность Марса, так или иначе. Уверен, это будет незабываемо. Мне кажется, наблюдение в телескоп за небесными телами должно быть такой же частью хорошего образования, как путешествия по миру.  <h2>Министерством ГО и ЧС РФ за №66-Б/00124 от 23 июня 2009за словесными горами в стране,</h2> Я увижу поверхность Марса, так или иначе. Уверен, это будет незабываемо. Мне кажется, наблюдение в телескоп за небесными телами должно быть такой же частью хорошего образования, как путешествия по миру.  <h2>Министерством ГО и ЧС РФ за №66-Б/00124 от 23 июня 2009за словесными горами в стране,</h2> Я увижу поверхность Марса, так или иначе. Уверен, это будет незабываемо. Мне кажется, наблюдение в телескоп за небесными телами должно быть такой же частью хорошего образования, как путешествия по миру.  <h2>Министерством ГО и ЧС РФ за №66-Б/00124 от 23 июня 2009за словесными горами в стране,</h2> Я увижу поверхность Марса, так или иначе. Уверен, это будет незабываемо. Мне кажется, наблюдение в телескоп за небесными телами должно быть такой же частью хорошего образования, как путешествия по миру.  <h2>Министерством ГО и ЧС РФ за №66-Б/00124 от 23 июня 2009за словесными горами в стране,</h2>
	  <h3>гласных и согласныхМинистерством ГО и ЧС РФ за №66-Б/00124 от 23 июня 2009Министерством ГО и ЧС РФ за №66-Б/00124 от 23 июня 2009</h3>
	  <h4>живут рыбные тексты. признанный эксперт в области проектирования, разработки, внедрения, обслуживания и ремонта оборудования систем безопастности. Деятельность предприятия по монтажу, техническому обслуживанию, и ремонту средств обеспечения пожарной </h4>
	  </div>
	  <div class="grid-item" :class="{inview: checkView(5)}"> Я увижу поверхность Марса, так или иначе. Уверен, это будет незабываемо. Мне кажется, наблюдение в телескоп за небесными телами должно быть такой же частью хорошего образования, как путешествия по миру.  <h2>Министерством ГО и ЧС РФ за №66-Б/00124 от 23 июня 2009за словесными горами в стране,</h2>
	  <h3>гласных и согласныхМинистерством ГО и ЧС РФ за №66-Б/00124 от 23 июня 2009Министерством ГО и ЧС РФ за №66-Б/00124 от 23 июня 2009</h3>
	  <h4>живут рыбные тексты. признанный эксперт в области проектирования, разработки, внедрения, обслуживания и ремонта оборудования систем безопастности. Деятельность предприятия по монтажу, техническому обслуживанию, и ремонту средств обеспечения пожарной </h4>
	  </div>  
	  <div class="grid-item" :class="{inview: checkView(6)}"> Я увижу поверхность Марса, так или иначе. Уверен, это будет незабываемо. Мне кажется, наблюдение в телескоп за небесными телами должно быть такой же частью хорошего образования, как путешествия по миру.  <h2>Министерством ГО и ЧС РФ за №66-Б/00124 от 23 июня 2009за словесными горами в стране,</h2> Я увижу поверхность Марса, так или иначе. Уверен, это будет незабываемо. Мне кажется, наблюдение в телескоп за небесными телами должно быть такой же частью хорошего образования, как путешествия по миру.  <h2>Министерством ГО и ЧС РФ за №66-Б/00124 от 23 июня 2009за словесными горами в стране,</h2> Я увижу поверхность Марса, так или иначе. Уверен, это будет незабываемо. Мне кажется, наблюдение в телескоп за небесными телами должно быть такой же частью хорошего образования, как путешествия по миру.  <h2>Министерством ГО и ЧС РФ за №66-Б/00124 от 23 июня 2009за словесными горами в стране,</h2> Я увижу поверхность Марса, так или иначе. Уверен, это будет незабываемо. Мне кажется, наблюдение в телескоп за небесными телами должно быть такой же частью хорошего образования, как путешествия по миру.  <h2>Министерством ГО и ЧС РФ за №66-Б/00124 от 23 июня 2009за словесными горами в стране,</h2> Я увижу поверхность Марса, так или иначе. Уверен, это будет незабываемо. Мне кажется, наблюдение в телескоп за небесными телами должно быть такой же частью хорошего образования, как путешествия по миру.  <h2>Министерством ГО и ЧС РФ за №66-Б/00124 от 23 июня 2009за словесными горами в стране,</h2>
	  <h3>гласных и согласныхМинистерством ГО и ЧС РФ за №66-Б/00124 от 23 июня 2009Министерством ГО и ЧС РФ за №66-Б/00124 от 23 июня 2009</h3>
	  <h4>живут рыбные тексты. признанный эксперт в области проектирования, разработки, внедрения, обслуживания и ремонта оборудования систем безопастности. Деятельность предприятия по монтажу, техническому обслуживанию, и ремонту средств обеспечения пожарной </h4>
	  </div>
	  <div class="grid-item" :class="{inview: checkView(7)}"> Я увижу поверхность Марса, так или иначе. Уверен, это будет незабываемо. Мне кажется, наблюдение в телескоп за небесными телами должно быть такой же частью хорошего образования, как путешествия по миру.  <h2>Министерством ГО и ЧС РФ за №66-Б/00124 от 23 июня 2009за словесными горами в стране,</h2>
	  <h3>гласных и согласныхМинистерством ГО и ЧС РФ за №66-Б/00124 от 23 июня 2009Министерством ГО и ЧС РФ за №66-Б/00124 от 23 июня 2009</h3>
	  <h4>живут рыбные тексты. признанный эксперт в области проектирования, разработки, внедрения, обслуживания и ремонта оборудования систем безопастности. Деятельность предприятия по монтажу, техническому обслуживанию, и ремонту средств обеспечения пожарной </h4>
	  </div>    
	  <div class="grid-item" :class="{inview: checkView(8)}"> BodyApp Я увижу поверхность Марса, так или иначе. Уверен, это будет незабываемо. Мне кажется, наблюдение в телескоп за небесными телами должно быть такой же частью хорошего образования, как путешествия по миру.  <h2>Министерством ГО и ЧС РФ за №66-Б/00124 от 23 июня 2009за словесными горами в стране,</h2> Я увижу поверхность Марса, так или иначе. Уверен, это будет незабываемо. Мне кажется, наблюдение в телескоп за небесными телами должно быть такой же частью хорошего образования, как путешествия по миру.  <h2>Министерством ГО и ЧС РФ за №66-Б/00124 от 23 июня 2009за словесными горами в стране,</h2> Я увижу поверхность Марса, так или иначе. Уверен, это будет незабываемо. Мне кажется, наблюдение в телескоп за небесными телами должно быть такой же частью хорошего образования, как путешествия по миру.  <h2>Министерством ГО и ЧС РФ за №66-Б/00124 от 23 июня 2009за словесными горами в стране,</h2> Я увижу поверхность Марса, так или иначе. Уверен, это будет незабываемо. Мне кажется, наблюдение в телескоп за небесными телами должно быть такой же частью хорошего образования, как путешествия по миру.  <h2>Министерством ГО и ЧС РФ за №66-Б/00124 от 23 июня 2009за словесными горами в стране,</h2> Я увижу поверхность Марса, так или иначе. Уверен, это будет незабываемо. Мне кажется, наблюдение в телескоп за небесными телами должно быть такой же частью хорошего образования, как путешествия по миру.  <h2>Министерством ГО и ЧС РФ за №66-Б/00124 от 23 июня 2009за словесными горами в стране,</h2>
	  <h3>гласных и согласныхМинистерством ГО и ЧС РФ за №66-Б/00124 от 23 июня 2009Министерством ГО и ЧС РФ за №66-Б/00124 от 23 июня 2009</h3>
	  <h4>живут рыбные тексты. признанный эксперт в области проектирования, разработки, внедрения, обслуживания и ремонта оборудования систем безопастности. Деятельность предприятия по монтажу, техническому обслуживанию, и ремонту средств обеспечения пожарной </h4>
	  </div>
	  <div class="grid-item" :class="{inview: checkView(9)}"> Я увижу поверхность Марса, так или иначе. Уверен, это будет незабываемо. Мне кажется, наблюдение в телескоп за небесными телами должно быть такой же частью хорошего образования, как путешествия по миру.  <h2>Министерством ГО и ЧС РФ за №66-Б/00124 от 23 июня 2009за словесными горами в стране,</h2> Я увижу поверхность Марса, так или иначе. Уверен, это будет незабываемо. Мне кажется, наблюдение в телескоп за небесными телами должно быть такой же частью хорошего образования, как путешествия по миру.  <h2>Министерством ГО и ЧС РФ за №66-Б/00124 от 23 июня 2009за словесными горами в стране,</h2> Я увижу поверхность Марса, так или иначе. Уверен, это будет незабываемо. Мне кажется, наблюдение в телескоп за небесными телами должно быть такой же частью хорошего образования, как путешествия по миру.  <h2>Министерством ГО и ЧС РФ за №66-Б/00124 от 23 июня 2009за словесными горами в стране,</h2> Я увижу поверхность Марса, так или иначе. Уверен, это будет незабываемо. Мне кажется, наблюдение в телескоп за небесными телами должно быть такой же частью хорошего образования, как путешествия по миру.  <h2>Министерством ГО и ЧС РФ за №66-Б/00124 от 23 июня 2009за словесными горами в стране,</h2> Я увижу поверхность Марса, так или иначе. Уверен, это будет незабываемо. Мне кажется, наблюдение в телескоп за небесными телами должно быть такой же частью хорошего образования, как путешествия по миру.  <h2>Министерством ГО и ЧС РФ за №66-Б/00124 от 23 июня 2009за словесными горами в стране,</h2>
	  <h3>гласных и согласныхМинистерством ГО и ЧС РФ за №66-Б/00124 от 23 июня 2009Министерством ГО и ЧС РФ за №66-Б/00124 от 23 июня 2009</h3>
	  <h4>живут рыбные тексты. признанный эксперт в области проектирования, разработки, внедрения, обслуживания и ремонта оборудования систем безопастности. Деятельность предприятия по монтажу, техническому обслуживанию, и ремонту средств обеспечения пожарной </h4>
	  </div>  
	  <div class="grid-item" :class="{inview: checkView(10)}"> Я увижу поверхность Марса, так или иначе. Уверен, это будет незабываемо. Мне кажется, наблюдение в телескоп за небесными телами должно быть такой же частью хорошего образования, как путешествия по миру.  <h2>Министерством ГО и ЧС РФ за №66-Б/00124 от 23 июня 2009за словесными горами в стране,</h2> Я увижу поверхность Марса, так или иначе. Уверен, это будет незабываемо. Мне кажется, наблюдение в телескоп за небесными телами должно быть такой же частью хорошего образования, как путешествия по миру.  <h2>Министерством ГО и ЧС РФ за №66-Б/00124 от 23 июня 2009за словесными горами в стране,</h2> Я увижу поверхность Марса, так или иначе. Уверен, это будет незабываемо. Мне кажется, наблюдение в телескоп за небесными телами должно быть такой же частью хорошего образования, как путешествия по миру.  <h2>Министерством ГО и ЧС РФ за №66-Б/00124 от 23 июня 2009за словесными горами в стране,</h2> Я увижу поверхность Марса, так или иначе. Уверен, это будет незабываемо. Мне кажется, наблюдение в телескоп за небесными телами должно быть такой же частью хорошего образования, как путешествия по миру.  <h2>Министерством ГО и ЧС РФ за №66-Б/00124 от 23 июня 2009за словесными горами в стране,</h2> Я увижу поверхность Марса, так или иначе. Уверен, это будет незабываемо. Мне кажется, наблюдение в телескоп за небесными телами должно быть такой же частью хорошего образования, как путешествия по миру.  <h2>Министерством ГО и ЧС РФ за №66-Б/00124 от 23 июня 2009за словесными горами в стране,</h2>
	  <h3>гласных и согласныхМинистерством ГО и ЧС РФ за №66-Б/00124 от 23 июня 2009Министерством ГО и ЧС РФ за №66-Б/00124 от 23 июня 2009</h3>
	  <h4>живут рыбные тексты. признанный эксперт в области проектирования, разработки, внедрения, обслуживания и ремонта оборудования систем безопастности. Деятельность предприятия по монтажу, техническому обслуживанию, и ремонту средств обеспечения пожарной </h4>
	  </div>
	  <div class="grid-item" :class="{inview: checkView(11)}"> Я увижу поверхность Марса, так или иначе. Уверен, это будет незабываемо. Мне кажется, наблюдение в телескоп за небесными телами должно быть такой же частью хорошего образования, как путешествия по миру.  <h2>Министерством ГО и ЧС РФ за №66-Б/00124 от 23 июня 2009за словесными горами в стране,</h2> Я увижу поверхность Марса, так или иначе. Уверен, это будет незабываемо. Мне кажется, наблюдение в телескоп за небесными телами должно быть такой же частью хорошего образования, как путешествия по миру.  <h2>Министерством ГО и ЧС РФ за №66-Б/00124 от 23 июня 2009за словесными горами в стране,</h2> Я увижу поверхность Марса, так или иначе. Уверен, это будет незабываемо. Мне кажется, наблюдение в телескоп за небесными телами должно быть такой же частью хорошего образования, как путешествия по миру.  <h2>Министерством ГО и ЧС РФ за №66-Б/00124 от 23 июня 2009за словесными горами в стране,</h2> Я увижу поверхность Марса, так или иначе. Уверен, это будет незабываемо. Мне кажется, наблюдение в телескоп за небесными телами должно быть такой же частью хорошего образования, как путешествия по миру.  <h2>Министерством ГО и ЧС РФ за №66-Б/00124 от 23 июня 2009за словесными горами в стране,</h2> Я увижу поверхность Марса, так или иначе. Уверен, это будет незабываемо. Мне кажется, наблюдение в телескоп за небесными телами должно быть такой же частью хорошего образования, как путешествия по миру.  <h2>Министерством ГО и ЧС РФ за №66-Б/00124 от 23 июня 2009за словесными горами в стране,</h2>
	  <h3>гласных и согласныхМинистерством ГО и ЧС РФ за №66-Б/00124 от 23 июня 2009Министерством ГО и ЧС РФ за №66-Б/00124 от 23 июня 2009</h3>
	  <h4>живут рыбные тексты. признанный эксперт в области проектирования, разработки, внедрения, обслуживания и ремонта оборудования систем безопастности. Деятельность предприятия по монтажу, техническому обслуживанию, и ремонту средств обеспечения пожарной </h4>
	  </div>    
	  <div class="grid-item" :class="{inview: checkView(12)}"> BodyApp Я увижу поверхность Марса, так или иначе. Уверен, это будет незабываемо. Мне кажется, наблюдение в телескоп за небесными телами должно быть такой же частью хорошего образования, как путешествия по миру.  <h2>Министерством ГО и ЧС РФ за №66-Б/00124 от 23 июня 2009за словесными горами в стране,</h2>
	  <h3>гласных и согласныхМинистерством ГО и ЧС РФ за №66-Б/00124 от 23 июня 2009Министерством ГО и ЧС РФ за №66-Б/00124 от 23 июня 2009</h3>
	  <h4>живут рыбные тексты. признанный эксперт в области проектирования, разработки, внедрения, обслуживания и ремонта оборудования систем безопастности. Деятельность предприятия по монтажу, техническому обслуживанию, и ремонту средств обеспечения пожарной </h4>
	  </div>
	  <div class="grid-item" :class="{inview: checkView(13)}"> Я увижу поверхность Марса, так или иначе. Уверен, это будет незабываемо. Мне кажется, наблюдение в телескоп за небесными телами должно быть такой же частью хорошего образования, как путешествия по миру.  <h2>Министерством ГО и ЧС РФ за №66-Б/00124 от 23 июня 2009за словесными горами в стране,</h2> Я увижу поверхность Марса, так или иначе. Уверен, это будет незабываемо. Мне кажется, наблюдение в телескоп за небесными телами должно быть такой же частью хорошего образования, как путешествия по миру.  <h2>Министерством ГО и ЧС РФ за №66-Б/00124 от 23 июня 2009за словесными горами в стране,</h2> Я увижу поверхность Марса, так или иначе. Уверен, это будет незабываемо. Мне кажется, наблюдение в телескоп за небесными телами должно быть такой же частью хорошего образования, как путешествия по миру.  <h2>Министерством ГО и ЧС РФ за №66-Б/00124 от 23 июня 2009за словесными горами в стране,</h2> Я увижу поверхность Марса, так или иначе. Уверен, это будет незабываемо. Мне кажется, наблюдение в телескоп за небесными телами должно быть такой же частью хорошего образования, как путешествия по миру.  <h2>Министерством ГО и ЧС РФ за №66-Б/00124 от 23 июня 2009за словесными горами в стране,</h2> Я увижу поверхность Марса, так или иначе. Уверен, это будет незабываемо. Мне кажется, наблюдение в телескоп за небесными телами должно быть такой же частью хорошего образования, как путешествия по миру.  <h2>Министерством ГО и ЧС РФ за №66-Б/00124 от 23 июня 2009за словесными горами в стране,</h2>
	  <h3>гласных и согласныхМинистерством ГО и ЧС РФ за №66-Б/00124 от 23 июня 2009Министерством ГО и ЧС РФ за №66-Б/00124 от 23 июня 2009</h3>
	  <h4>живут рыбные тексты. признанный эксперт в области проектирования, разработки, внедрения, обслуживания и ремонта оборудования систем безопастности. Деятельность предприятия по монтажу, техническому обслуживанию, и ремонту средств обеспечения пожарной </h4>
	  </div>  
	  <div class="grid-item" :class="{inview: checkView(14)}"> Я увижу поверхность Марса, так или иначе. Уверен, это будет незабываемо. Мне кажется, наблюдение в телескоп за небесными телами должно быть такой же частью хорошего образования, как путешествия по миру.  <h2>Министерством ГО и ЧС РФ за №66-Б/00124 от 23 июня 2009за словесными горами в стране,</h2> Я увижу поверхность Марса, так или иначе. Уверен, это будет незабываемо. Мне кажется, наблюдение в телескоп за небесными телами должно быть такой же частью хорошего образования, как путешествия по миру.  <h2>Министерством ГО и ЧС РФ за №66-Б/00124 от 23 июня 2009за словесными горами в стране,</h2> Я увижу поверхность Марса, так или иначе. Уверен, это будет незабываемо. Мне кажется, наблюдение в телескоп за небесными телами должно быть такой же частью хорошего образования, как путешествия по миру.  <h2>Министерством ГО и ЧС РФ за №66-Б/00124 от 23 июня 2009за словесными горами в стране,</h2> Я увижу поверхность Марса, так или иначе. Уверен, это будет незабываемо. Мне кажется, наблюдение в телескоп за небесными телами должно быть такой же частью хорошего образования, как путешествия по миру.  <h2>Министерством ГО и ЧС РФ за №66-Б/00124 от 23 июня 2009за словесными горами в стране,</h2>
	  <h3>гласных и согласныхМинистерством ГО и ЧС РФ за №66-Б/00124 от 23 июня 2009Министерством ГО и ЧС РФ за №66-Б/00124 от 23 июня 2009</h3>
	  <h4>живут рыбные тексты. признанный эксперт в области проектирования, разработки, внедрения, обслуживания и ремонта оборудования систем безопастности. Деятельность предприятия по монтажу, техническому обслуживанию, и ремонту средств обеспечения пожарной </h4>
	  </div>
	  <div class="grid-item" :class="{inview: checkView(15)}"> Я увижу поверхность Марса, так или иначе. Уверен, это будет незабываемо. Мне кажется, наблюдение в телескоп за небесными телами должно быть такой же частью хорошего образования, как путешествия по миру.  <h2>Министерством ГО и ЧС РФ за №66-Б/00124 от 23 июня 2009за словесными горами в стране,</h2> Я увижу поверхность Марса, так или иначе. Уверен, это будет незабываемо. Мне кажется, наблюдение в телескоп за небесными телами должно быть такой же частью хорошего образования, как путешествия по миру.  <h2>Министерством ГО и ЧС РФ за №66-Б/00124 от 23 июня 2009за словесными горами в стране,</h2> Я увижу поверхность Марса, так или иначе. Уверен, это будет незабываемо. Мне кажется, наблюдение в телескоп за небесными телами должно быть такой же частью хорошего образования, как путешествия по миру.  <h2>Министерством ГО и ЧС РФ за №66-Б/00124 от 23 июня 2009за словесными горами в стране,</h2> Я увижу поверхность Марса, так или иначе. Уверен, это будет незабываемо. Мне кажется, наблюдение в телескоп за небесными телами должно быть такой же частью хорошего образования, как путешествия по миру.  <h2>Министерством ГО и ЧС РФ за №66-Б/00124 от 23 июня 2009за словесными горами в стране,</h2>
	  <h3>гласных и согласныхМинистерством ГО и ЧС РФ за №66-Б/00124 от 23 июня 2009Министерством ГО и ЧС РФ за №66-Б/00124 от 23 июня 2009</h3>
	  <h4>живут рыбные тексты. признанный эксперт в области проектирования, разработки, внедрения, обслуживания и ремонта оборудования систем безопастности. Деятельность предприятия по монтажу, техническому обслуживанию, и ремонту средств обеспечения пожарной </h4>
	  </div> 
	  <bodyappi 
	  	:scrollTop="scrollTop"
	  	:scrollBottom="scrollBottom"
	  	:animate="animate"
	  	></bodyappi>      
  </div>
</template>

<script>
import Uslugi from './uslugi.vue';
import advantage from './advantage.vue';
export default {
	components: {
			uslugi: Uslugi,
			advantage: advantage
	},
  data: function () {
    return {
      scrollTop: '',
      scrollBottom: '',
      animate: ''
    }
  },
  mounted(){
  	this.scrollTop = window.scrollY;
    this.scrollBottom = window.scrollY + window.innerHeight;
    window.addEventListener('scroll', _.throttle(this.scrollHandler, 300))
    this.animate = document.querySelectorAll(".grid-item")
  },
  methods: {
  	checkView(e){
      if(this.animate){
        let element = this.animate[e];
        let elTop = element.offsetTop;
        let elBottom = element.offsetTop + element.scrollHeight;
        if(this.scrollBottom > (elTop + 100) && (elBottom - 50) > this.scrollTop){
          let images = Array.prototype.slice.call(element.getElementsByTagName('img'));
          images.forEach(img => {
            if(img.getAttribute('data-src')){
              img.src = img.getAttribute('data-src');
              img.setAttribute('data-src', '')
            }
          })
          return true;
        } else {
          return false;
        }
      }
    },
  	scrollHandler(){
      this.scrollBottom = window.scrollY + window.innerHeight;
      this.scrollTop = window.scrollY;
    }
  }
}
</script>

<style>
@import "../../app/assets/stylesheets/postcss/variables";
.bodyApp {

}
.grid-item {
	transition: 1s ease-in-out;
	opacity: 0;
}
.inview {
	opacity: 1;
}
</style>